---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsAttrTreadMaterial
source: html/2748ae10-f195-2d2c-741d-a48e66d5e426.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsAttrTreadMaterial Property

"Tread Material"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsAttrTreadMaterial { get; }
```